#!/usr/bin/env perl

use strict;
use warnings;
use Data::Dumper;
use Math::MatrixReal;
use Text::CSV_XS qw( csv );

my @Strength = ('調和性','コミュニケーション','共感性','包含','個別化','親密性','責任感','指令性','競争性','成長促進','ポジティブ','最上志向','社交性','達成欲','活発性','信念','自我','規律性','適応性','目標志向','回復志向','自己確信','分析思考','アレンジ','慎重さ','運命思考','公平性','未来志向','着想','収集心','内省','学習欲','原点思考','戦略性');

$, = ",";

my @q2avil = ('個別化','未来志向','包含','競争性','責任感','最上志向(?)','共感性','個別化','慎重さ','運命思考','コミュニケーション','親密性','信念','社交性','規律性','最上志向','公平性','未来志向','未来志向','活発性','達成欲','原点思考','コミュニケーション','成長促進','競争性','回復志向','ポジティブ','自我','指令性','共感性','成長促進','ポジティブ','包含','原点思考','運命思考','信念','包含','規律性','個別化','原点思考','個別化','適応性','着想','コミュニケーション','最上志向(?)','アレンジ','収集心','規律性','共感性','未来志向','達成欲','親密性','包含','指令性(?)','原点思考','分析思考','最上志向','規律性','着想','競争性','調和性','目標志向','調和性','公平性','回復志向','成長促進','競争性','個別化','慎重さ','共感性','個別化','自己確信','適応性','包含','目標志向','目標志向','適応性','共感性','成長促進','規律性','運命思考','規律性','成長促進','コミュニケーション','コミュニケーション','ポジティブ','コミュニケーション','最上志向','分析思考','回復志向','自我','社交性','コミュニケーション','指令性','学習欲','着想','個別化','回復志向','活発性','活発性','社交性','自己確信','親密性','規律性','自己確信','競争性','慎重さ','共感性','指令性','調和性','学習欲','個別化','学習欲','目標志向','原点思考','内省','未来志向','分析思考','コミュニケーション','自我','社交性','自己確信','規律性','活発性(?)','目標志向','アレンジ','内省','ポジティブ','親密性','原点思考','規律性','信念','学習欲','公平性','適応性','戦略性(?)','学習欲','原点思考','回復志向','公平性','責任感','調和性','戦略性(?)','成長促進','指令性','アレンジ(?)','ポジティブ','活発性','社交性','共感性','未来志向','達成欲','競争性','自我','アレンジ','共感性(?)','戦略性','社交性','分析思考','収集心','分析思考','コミュニケーション','コミュニケーション','学習欲','内省','学習欲','学習欲','収集心','規律性','着想','着想','収集心','競争性','信念','内省','最上志向','指令性','公平性','原点思考','自我','戦略性','アレンジ','回復志向','分析思考','包含','社交性','自己確信','責任感','成長促進','競争性','指令性','着想','信念','信念','目標志向','運命思考','慎重さ','戦略性','運命思考','親密性','自我','達成欲','戦略性','原点思考','社交性','自我','包含','調和性','調和性','収集心','未来志向','分析思考','アレンジ','責任感','分析思考','親密性','最上志向','成長促進','分析思考','運命思考','共感性','包含','達成欲','個別化','自己確信','学習欲','適応性','戦略性','目標志向','慎重さ','自我','戦略性','回復志向(?)','回復志向','適応性','公平性','個別化','規律性','運命思考(?)','着想','個別化','戦略性','個別化','競争性','公平性','活発性','着想','指令性(?)','内省','アレンジ','社交性','運命思考','適応性','未来志向','収集心(?)','自我','調和性','内省','ポジティブ','信念','親密性','成長促進','未来志向','内省','達成欲','戦略性','最上志向','信念','包含','慎重さ','責任感','活発性','慎重さ','公平性','最上志向','アレンジ','収集心(?)','親密性','信念','社交性','ポジティブ','学習欲','ポジティブ','指令性','慎重さ','最上志向','責任感','収集心','ポジティブ','信念','ポジティブ','目標志向(?)','親密性','原点思考','調和性','慎重さ','適応性','活発性','着想(?)','親密性','目標志向','共感性(?)','回復志向','責任感','成長促進','目標志向','達成欲','達成欲','公平性','自我','責任感','原点思考','信念','親密性','適応性','適応性','運命思考','競争性','活発性','未来志向','調和性','自己確信','達成欲','責任感','収集心','慎重さ','自己確信','自己確信','アレンジ','アレンジ','慎重さ(?)','内省','自己確信','達成欲','着想','内省','戦略性','調和性','運命思考','内省','分析思考','活発性(?)','指令性','分析思考','自我','責任感','達成欲','収集心','アレンジ','公平性','自己確信','包含','回復志向','社交性');

@q2avil = map{  $_ =~ s/\(\?\)$//g; $_ } @q2avil;

my @answer = (1,-1,-1,2,1,1,1,-1,-1,-2,1,1,-1,-1,2,-1,0,1,0,2,0,1,1,-1,-1,1,-1,-2,-1,2,1,-2,-1,2,-1,-1,1,0,1,-2,2,-1,2,-2,2,1,0,-2,1,1,0,-2,1,-2,-2,1,2,2,-1,-1,1,1,0,-1,1,-1,-1,0,1,1,-1,-1,-1,-2,1,-1,-1,-2,-1,1,1,1,-2,1,-1,2,0,-1,-1,-1,-1,2,-1,0,-1,1,2,-2,1,-1,1,-1,-1,-1,1,0,1,1,0,1,0,2,-1,1,-2,-1,-2,-1,1,0,2,2,-2,1,2,1,1,-1,2,-1,-2,1,-1,-2,-1,-1,-1,1,-1,0,-2,2,-1,2,1,0,1,-1,2,1,-1,1,1,1,1,1,-2,-1,-1,0,0,-1,1,-2,-1,2,-1,-1,-2,1,-1,-1,-1,1,1,2,-1);

for (my $i=0;$i<177;$i++){
  $answer[($i+177)] = ( $answer[$i] * (-1) );
}

my %hash;

for(my $i=0;$i<354;$i++){
  $hash{'total'}{$q2avil[$i]} +=  $answer[$i];
  $hash{'count'}{$q2avil[$i]}++;
}

my @result = 
  map{$_->[0]}
  sort {$b->[1] <=> $a->[1]}
  map{ [$_, ($hash{'total'}{"$_"}/$hash{'count'}{"$_"})] }keys $hash{'total'};

print Dumper @result;



__END__

正解: 最上志向, 個別化, 原点思考, 自我, 活発性

テスト: 社交性, 最上志向, 個別化, 信念, 自我
正確テスト: 社交性, 最上志向, 個別化, 信念, 共感性, 自我, 達成欲
